// 10. Вывести на экран последнюю цифру целого числа введенного с клавиатуры. 
Console.WriteLine("Привет! Это ПО выводит последнюю цифру введенного числа");
Console.WriteLine("Введите число: ");
int a;
