// 11. Дано число больше 9. Вывести на экран  вторую цифру числа с конца
Console.WriteLine("Привет! Данная программа выводит вторую цифру в числах больше 9.");
Console.WriteLine("Введите число: ");
int i;